CSI API ETABS v1
cOAPI Methods
The cOAPI type exposes the following members.
Methods
Name | Description
ApplicationExit
 Exits the application.
ApplicationStart
 This function starts the application.
GetOAPIVersionNumber
 Retrieves the API version number implemented by the GUI.
Hide
 This function hides the application. When the application is hidden it is not visible on the screen or on the Windows task bar.
InternalExec
 For internal use.
SetAsActiveObject
 This function sets the active ETABSObject instance in the system Running Object Table (ROT), replacing the previous instance (if any).
Unhide
 This function unhides the application, that is, it makes it visible. When the application is hidden, it is not visible on the screen or on the Windows task bar.
UnsetAsActiveObject
 This function removes the ETABSObject instance from the system Running Object Table (ROT).
Visible
 This function gets the application visibility.
Top
See Also
Reference
cOAPI Interface
ETABSv1 Namespace